#+property: header-args :comments both :results values :exports both :noweb yes

*** Hello, this is my first time I trying to using Wolfram language to solve AOC.
#+name: links
#+begin_src elisp :exports both
(cl-map 'list (lambda (number)
                `( ,number
                   ,(format "[[https://github.com/nhannht/aoc2023/blob/master/%s.pdf][pdf]]" number)
                   ,(format "[[https://github.com/nhannht/aoc2023/blob/master/%s.nb][notebook]]" number)
                   ))
        (number-sequence 1 30))
#+end_src

#+RESULTS: links
|  1 | [[https://github.com/nhannht/aoc2023/blob/master/1.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/1.nb][notebook]] |
|  2 | [[https://github.com/nhannht/aoc2023/blob/master/2.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/2.nb][notebook]] |
|  3 | [[https://github.com/nhannht/aoc2023/blob/master/3.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/3.nb][notebook]] |
|  4 | [[https://github.com/nhannht/aoc2023/blob/master/4.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/4.nb][notebook]] |
|  5 | [[https://github.com/nhannht/aoc2023/blob/master/5.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/5.nb][notebook]] |
|  6 | [[https://github.com/nhannht/aoc2023/blob/master/6.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/6.nb][notebook]] |
|  7 | [[https://github.com/nhannht/aoc2023/blob/master/7.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/7.nb][notebook]] |
|  8 | [[https://github.com/nhannht/aoc2023/blob/master/8.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/8.nb][notebook]] |
|  9 | [[https://github.com/nhannht/aoc2023/blob/master/9.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/9.nb][notebook]] |
| 10 | [[https://github.com/nhannht/aoc2023/blob/master/10.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/10.nb][notebook]] |
| 11 | [[https://github.com/nhannht/aoc2023/blob/master/11.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/11.nb][notebook]] |
| 12 | [[https://github.com/nhannht/aoc2023/blob/master/12.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/12.nb][notebook]] |
| 13 | [[https://github.com/nhannht/aoc2023/blob/master/13.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/13.nb][notebook]] |
| 14 | [[https://github.com/nhannht/aoc2023/blob/master/14.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/14.nb][notebook]] |
| 15 | [[https://github.com/nhannht/aoc2023/blob/master/15.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/15.nb][notebook]] |
| 16 | [[https://github.com/nhannht/aoc2023/blob/master/16.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/16.nb][notebook]] |
| 17 | [[https://github.com/nhannht/aoc2023/blob/master/17.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/17.nb][notebook]] |
| 18 | [[https://github.com/nhannht/aoc2023/blob/master/18.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/18.nb][notebook]] |
| 19 | [[https://github.com/nhannht/aoc2023/blob/master/19.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/19.nb][notebook]] |
| 20 | [[https://github.com/nhannht/aoc2023/blob/master/20.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/20.nb][notebook]] |
| 21 | [[https://github.com/nhannht/aoc2023/blob/master/21.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/21.nb][notebook]] |
| 22 | [[https://github.com/nhannht/aoc2023/blob/master/22.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/22.nb][notebook]] |
| 23 | [[https://github.com/nhannht/aoc2023/blob/master/23.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/23.nb][notebook]] |
| 24 | [[https://github.com/nhannht/aoc2023/blob/master/24.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/24.nb][notebook]] |
| 25 | [[https://github.com/nhannht/aoc2023/blob/master/25.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/25.nb][notebook]] |
| 26 | [[https://github.com/nhannht/aoc2023/blob/master/26.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/26.nb][notebook]] |
| 27 | [[https://github.com/nhannht/aoc2023/blob/master/27.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/27.nb][notebook]] |
| 28 | [[https://github.com/nhannht/aoc2023/blob/master/28.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/28.nb][notebook]] |
| 29 | [[https://github.com/nhannht/aoc2023/blob/master/29.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/29.nb][notebook]] |
| 30 | [[https://github.com/nhannht/aoc2023/blob/master/30.pdf][pdf]] | [[https://github.com/nhannht/aoc2023/blob/master/30.nb][notebook]] |

#+name: letters
#+begin_src elisp :var l=links :exports both
(shell-command-to-string (format "figlet Thank for %s nice challenge" (length l)))
#+end_src

#+RESULTS: letters
#+begin_example
 _____ _                 _       __              _____  ___
|_   _| |__   __ _ _ __ | | __  / _| ___  _ __  |___ / / _ \
  | | | '_ \ / _` | '_ \| |/ / | |_ / _ \| '__|   |_ \| | | |
  | | | | | | (_| | | | |   <  |  _| (_) | |     ___) | |_| |
  |_| |_| |_|\__,_|_| |_|_|\_\ |_|  \___/|_|    |____/ \___/

       _                 _           _ _
 _ __ (_) ___ ___    ___| |__   __ _| | | ___ _ __   __ _  ___
| '_ \| |/ __/ _ \  / __| '_ \ / _` | | |/ _ \ '_ \ / _` |/ _ \
| | | | | (_|  __/ | (__| | | | (_| | | |  __/ | | | (_| |  __/
|_| |_|_|\___\___|  \___|_| |_|\__,_|_|_|\___|_| |_|\__, |\___|
                                                    |___/
#+end_example
